In [1]:
#pandas ==>lib fo data writing and reading  
import pandas as pd
import numpy as np
a=np.array([1,2,3,4])
s=pd.Series(a)         #each column is a series inside matrix or array or df
s

0    1
1    2
2    3
3    4
dtype: int32

In [2]:
s=pd.Series(a,index=[100,101,102,103])
s

100    1
101    2
102    3
103    4
dtype: int32

In [3]:
dic={"x":"Hello","y":"Hi","z":"HighFive"}
s=pd.Series(dic)
s

x       Hello
y          Hi
z    HighFive
dtype: object

In [4]:
type(s)

pandas.core.series.Series

In [5]:
dic={"x":3,"y":4,"z":5}
s=pd.Series(dic,index=['x','z','y','a'])
s

x    3.0
z    5.0
y    4.0
a    NaN
dtype: float64

In [6]:
#creating pandas dataframe
df=pd.DataFrame()  #create empty dataframe
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
l=list(range(6))     
df=pd.DataFrame(l)
df

   0
0  0
1  1
2  2
3  3
4  4
5  5

In [8]:
dic={"Name":["Div","Mut","Naru"],"age":[30,31,3]}
df=pd.DataFrame(dic,index=[1,2,3])
df

   Name  age
1   Div   30
2   Mut   31
3  Naru    3

In [9]:
df["age"]

1    30
2    31
3     3
Name: age, dtype: int64

In [10]:
df['Height']=pd.Series([150,160,170],index=[1,2,3])
df['Add']=df["age"]+df["Height"]
df

   Name  age  Height  Add
1   Div   30     150  180
2   Mut   31     160  191
3  Naru    3     170  173

In [11]:
df.drop(['Height'],1,inplace=True)   #1 means axis=1 and column name should be in list when we need to remove more than 1 column
df

   Name  age  Add
1   Div   30  180
2   Mut   31  191
3  Naru    3  173

In [12]:
df_1=df.drop(['Add'],1)    #so drop can be used to del particular column and no impact on main df but del will del it in main df
df_1

   Name  age
1   Div   30
2   Mut   31
3  Naru    3

In [13]:
df

   Name  age  Add
1   Div   30  180
2   Mut   31  191
3  Naru    3  173

In [14]:
df_2=df.drop(2,axis=0)
df_2   
#Row with index 2 is deleted

   Name  age  Add
1   Div   30  180
3  Naru    3  173

In [15]:
#descriptive statistics ==>get the data , identify data and analyze the data
#Inferential statistics==>sample -->apply statistical methods-->apply implement
#ADS==>Analytical Data Set
#Analytics==>leverage the business by finding the most wanted things as for running the business there are many fileds/persons like java/internal tools

In [16]:
import pandas as pd
dic={"Name":["Div","Mut","Naru"],"age":[30,31,3]}
df=pd.DataFrame(dic,index=[1,2,3])
df

   Name  age
1   Div   30
2   Mut   31
3  Naru    3

In [17]:
df['Height']=pd.Series([150,160,170],index=[1,2,3])
df['Add']=df["age"]+df["Height"]
df

   Name  age  Height  Add
1   Div   30     150  180
2   Mut   31     160  191
3  Naru    3     170  173

In [18]:
#search -->Selection of rows --> 1)loc ==>location/label based 1)iloc ==>index based
df.loc[:,'age']

1    30
2    31
3     3
Name: age, dtype: int64

In [19]:
df.index=['a','b','c']
df

   Name  age  Height  Add
a   Div   30     150  180
b   Mut   31     160  191
c  Naru    3     170  173

In [20]:
df.loc['b']   #row b

Name      Mut
age        31
Height    160
Add       191
Name: b, dtype: object

In [21]:
df.loc['b':'c',['Height','age']]  #c and b row with selective columns

   Height  age
b     160   31
c     170    3

In [22]:
df.loc['c',['Height','age']] #c row with selective columns

Height    170
age         3
Name: c, dtype: object

In [23]:
df.iloc[1]  #integer location

Name      Mut
age        31
Height    160
Add       191
Name: b, dtype: object

In [24]:
df.loc[-1]=["Vani",57,175,189]
df

    Name  age  Height  Add
a    Div   30     150  180
b    Mut   31     160  191
c   Naru    3     170  173
-1  Vani   57     175  189

In [25]:
df.index=['a','b','c','d']
df

   Name  age  Height  Add
a   Div   30     150  180
b   Mut   31     160  191
c  Naru    3     170  173
d  Vani   57     175  189

In [26]:
df.drop(['Add'],1,inplace=True)  
df

   Name  age  Height
a   Div   30     150
b   Mut   31     160
c  Naru    3     170
d  Vani   57     175

In [27]:
df.loc[df['age']>20]

   Name  age  Height
a   Div   30     150
b   Mut   31     160
d  Vani   57     175

In [28]:
df1=pd.DataFrame([[1,2],[3,4]], columns = ['a','b'])
df2=pd.DataFrame([[5,6],[7,8]], columns = ['a','b']) 
df3=df1.append(df2)
 
df3

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [29]:
df3.index=[0,1,2,3] 
df3

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [30]:
dic={"Name":pd.Series(["Div","Mut","Naru","Vani","Diva","Krish","Achu"]) ,
                     "Age":pd.Series([25,5,6,89,91,67,29]),
    "Rating":pd.Series([4.23,5.16,7.89,8.9,6,7,8.9])}
df=pd.DataFrame(dic)
df

    Name  Age  Rating
0    Div   25    4.23
1    Mut    5    5.16
2   Naru    6    7.89
3   Vani   89    8.90
4   Diva   91    6.00
5  Krish   67    7.00
6   Achu   29    8.90

In [31]:
df.head()   #First five records

   Name  Age  Rating
0   Div   25    4.23
1   Mut    5    5.16
2  Naru    6    7.89
3  Vani   89    8.90
4  Diva   91    6.00

In [32]:
df.tail()  #last five records

    Name  Age  Rating
2   Naru    6    7.89
3   Vani   89    8.90
4   Diva   91    6.00
5  Krish   67    7.00
6   Achu   29    8.90

In [33]:
df.T   #in terms of manipulation and observation useful

           0     1     2     3     4      5     6
Name     Div   Mut  Naru  Vani  Diva  Krish  Achu
Age       25     5     6    89    91     67    29
Rating  4.23  5.16  7.89   8.9     6      7   8.9

In [34]:
df.axes  #starting ending as well as the labels

[RangeIndex(start=0, stop=7, step=1),
 Index(['Name', 'Age', 'Rating'], dtype='object')]

In [35]:
df.dtypes  #in pandas string datatype is object if one string is there out of 100 records then dtype becomes object

Name       object
Age         int64
Rating    float64
dtype: object

In [36]:
df.empty  #even if we have only one Nan then True output

False

In [37]:
df.shape

(7, 3)

In [38]:
df.size #Total items

21

In [39]:
#statistical function of pandas
df

    Name  Age  Rating
0    Div   25    4.23
1    Mut    5    5.16
2   Naru    6    7.89
3   Vani   89    8.90
4   Diva   91    6.00
5  Krish   67    7.00
6   Achu   29    8.90

In [40]:
df.sum()  #row addition with string as well

Name      DivMutNaruVaniDivaKrishAchu
Age                               312
Rating                          48.08
dtype: object

In [41]:
df.sum(1) #means axis=1 column addition

0    29.23
1    10.16
2    13.89
3    97.90
4    97.00
5    74.00
6    37.90
dtype: float64

In [42]:
df.mean()

Age       44.571429
Rating     6.868571
dtype: float64

In [43]:
df.median()  #sort the data then find the nth(centre) term  #odd number of items then n+1/2 5items 6/2 =3 rd number
#even number then n+1/2 eg:6items 7/2=3.5 then 3rd and 4th number

Age       29.0
Rating     7.0
dtype: float64

In [44]:
df.std() #how far each values are deviated from the mean

Age       37.219427
Rating     1.823444
dtype: float64

In [45]:
df.count() #count of column

Name      7
Age       7
Rating    7
dtype: int64

In [46]:
df["Age"].max()

91

In [47]:
df["Name"].min()

'Achu'

In [48]:
df.describe()  #columns that can do manipulations (integers)

             Age    Rating
count   7.000000  7.000000
mean   44.571429  6.868571
std    37.219427  1.823444
min     5.000000  4.230000
25%    15.500000  5.580000
50%    29.000000  7.000000
75%    78.000000  8.395000
max    91.000000  8.900000

In [49]:
import numpy as np
df

    Name  Age  Rating
0    Div   25    4.23
1    Mut    5    5.16
2   Naru    6    7.89
3   Vani   89    8.90
4   Diva   91    6.00
5  Krish   67    7.00
6   Achu   29    8.90

In [50]:
df.drop(['Name'],1,inplace=True)   
df

   Age  Rating
0   25    4.23
1    5    5.16
2    6    7.89
3   89    8.90
4   91    6.00
5   67    7.00
6   29    8.90

In [51]:
df.apply(np.mean)

Age       44.571429
Rating     6.868571
dtype: float64

In [52]:
df.apply(np.mean,axis=1)

0    14.615
1     5.080
2     6.945
3    48.950
4    48.500
5    37.000
6    18.950
dtype: float64

In [53]:
df.apply(lambda x:x.max()-x.min())

Age       86.00
Rating     4.67
dtype: float64

In [54]:
df.apply(lambda x:x.max()-x.min(),axis=1)  #column wise addition

0    20.77
1     0.16
2     1.89
3    80.10
4    85.00
5    60.00
6    20.10
dtype: float64

In [55]:
dic={"Name":pd.Series(["Div","Mut","Naru","Vani","Diva","Krish","Achu"]) ,
                     "Age":pd.Series([25,5,6,89,91,67,29]),
    "Rating":pd.Series([4.23,5.16,7.89,8.9,6,7,8.9])}
df=pd.DataFrame(dic)
df

    Name  Age  Rating
0    Div   25    4.23
1    Mut    5    5.16
2   Naru    6    7.89
3   Vani   89    8.90
4   Diva   91    6.00
5  Krish   67    7.00
6   Achu   29    8.90

In [56]:
df.rename(columns={'Age':"col1","Name":"col2","Rating":"col3"})  #Scenarion one df has id and emp seond has ids and age then rename id so that they can be merged
#if i give df=df.rename(columns={'Age':"col1","Name":"col2","Rating":"col3"}) then dataframe will be changed

    col2  col1  col3
0    Div    25  4.23
1    Mut     5  5.16
2   Naru     6  7.89
3   Vani    89  8.90
4   Diva    91  6.00
5  Krish    67  7.00
6   Achu    29  8.90

In [57]:
df=pd.DataFrame(np.random.randn(5,2),index=[1,5,4,3,2],columns=["col1","col2"])
df

       col1      col2
1 -1.536034 -1.317329
5 -0.519811 -0.828518
4 -0.300581  0.835356
3 -1.056517  0.345871
2  1.377484  0.786724

In [58]:
df.sort_index()

       col1      col2
1 -1.536034 -1.317329
2  1.377484  0.786724
3 -1.056517  0.345871
4 -0.300581  0.835356
5 -0.519811 -0.828518

In [59]:
df.sort_index(ascending=False)

       col1      col2
5 -0.519811 -0.828518
4 -0.300581  0.835356
3 -1.056517  0.345871
2  1.377484  0.786724
1 -1.536034 -1.317329

In [60]:
df.sort_index(axis=1)

       col1      col2
1 -1.536034 -1.317329
5 -0.519811 -0.828518
4 -0.300581  0.835356
3 -1.056517  0.345871
2  1.377484  0.786724

In [61]:
df.sort_values(by='col2')

       col1      col2
1 -1.536034 -1.317329
5 -0.519811 -0.828518
3 -1.056517  0.345871
2  1.377484  0.786724
4 -0.300581  0.835356

In [62]:
dic={"Name":pd.Series(["Div","Mut","Naru","Vani","Diva","Krish","Achu"]) ,
                     "Age":pd.Series([25,5,6,89,91,67,29]),
    "Rating":pd.Series([4.23,5.16,7.89,8.9,6,7,8.9])}
df1=pd.DataFrame(dic)
df1

    Name  Age  Rating
0    Div   25    4.23
1    Mut    5    5.16
2   Naru    6    7.89
3   Vani   89    8.90
4   Diva   91    6.00
5  Krish   67    7.00
6   Achu   29    8.90

In [63]:
df1.loc[:3,["Age","Rating"]]  #loc ==>label based so till 3 records will be there when we don't know the index where lot of records

   Age  Rating
0   25    4.23
1    5    5.16
2    6    7.89
3   89    8.90

In [64]:
df1.iloc[:3]  # whereas iloc is index based so till 2(n-1) will come

   Name  Age  Rating
0   Div   25    4.23
1   Mut    5    5.16
2  Naru    6    7.89

In [65]:
df1.iloc[0:4,0:2]

   Name  Age
0   Div   25
1   Mut    5
2  Naru    6
3  Vani   89

In [66]:
df1.iloc[:,1:]

   Age  Rating
0   25    4.23
1    5    5.16
2    6    7.89
3   89    8.90
4   91    6.00
5   67    7.00
6   29    8.90

In [67]:
df=pd.DataFrame(np.random.randn(5,3),index=["a","c","e","f","h"],columns=["col1","col2","col3"])
df

       col1      col2      col3
a  0.042534 -1.870959 -0.178145
c  0.724064  0.139625  0.747713
e -1.260553  0.110923 -0.670237
f -0.765257 -0.537791 -0.217907
h -1.074185  0.178230  2.584094

In [68]:
df=df.reindex(['a','b','c','d','e','f','g','h'])

In [69]:
df

       col1      col2      col3
a  0.042534 -1.870959 -0.178145
b       NaN       NaN       NaN
c  0.724064  0.139625  0.747713
d       NaN       NaN       NaN
e -1.260553  0.110923 -0.670237
f -0.765257 -0.537791 -0.217907
g       NaN       NaN       NaN
h -1.074185  0.178230  2.584094

In [70]:
df["col1"].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: col1, dtype: bool

In [71]:
df["col1"].isna()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: col1, dtype: bool

In [72]:
df["col1"].notnull()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: col1, dtype: bool

In [73]:
df["col3"].isnull().sum()

3

In [74]:
#df=df[df>0] to remove all negative values , impute means override
df["col1"].fillna(0)

a    0.042534
b    0.000000
c    0.724064
d    0.000000
e   -1.260553
f   -0.765257
g    0.000000
h   -1.074185
Name: col1, dtype: float64

In [75]:
df

       col1      col2      col3
a  0.042534 -1.870959 -0.178145
b       NaN       NaN       NaN
c  0.724064  0.139625  0.747713
d       NaN       NaN       NaN
e -1.260553  0.110923 -0.670237
f -0.765257 -0.537791 -0.217907
g       NaN       NaN       NaN
h -1.074185  0.178230  2.584094

In [76]:
df.fillna(1)

       col1      col2      col3
a  0.042534 -1.870959 -0.178145
b  1.000000  1.000000  1.000000
c  0.724064  0.139625  0.747713
d  1.000000  1.000000  1.000000
e -1.260553  0.110923 -0.670237
f -0.765257 -0.537791 -0.217907
g  1.000000  1.000000  1.000000
h -1.074185  0.178230  2.584094

In [77]:
df.fillna(1,inplace=True)
df

       col1      col2      col3
a  0.042534 -1.870959 -0.178145
b  1.000000  1.000000  1.000000
c  0.724064  0.139625  0.747713
d  1.000000  1.000000  1.000000
e -1.260553  0.110923 -0.670237
f -0.765257 -0.537791 -0.217907
g  1.000000  1.000000  1.000000
h -1.074185  0.178230  2.584094

In [78]:
df=pd.DataFrame(np.random.randn(5,3),index=["a","c","e","f","h"],columns=["col1","col2","col3"])
df=df.reindex(['a','b','c','d','e','f','g','h'])
df

       col1      col2      col3
a  0.420264  1.171766  1.607079
b       NaN       NaN       NaN
c  1.339361  0.297800  0.095200
d       NaN       NaN       NaN
e  0.777678 -0.181961  1.129256
f  0.532037 -1.072116 -0.453534
g       NaN       NaN       NaN
h  1.107761  0.915610 -0.808302

In [79]:
df.loc["d":"f"]=pd.Series({"col1":np.NaN,"col2":np.NaN,"col3":np.NaN})
df

#If a column has only one Nan value that column will be removed

       col1      col2      col3
a  0.420264  1.171766  1.607079
b       NaN       NaN       NaN
c  1.339361  0.297800  0.095200
d       NaN       NaN       NaN
e       NaN       NaN       NaN
f       NaN       NaN       NaN
g       NaN       NaN       NaN
h  1.107761  0.915610 -0.808302

In [80]:
df.dropna()

       col1      col2      col3
a  0.420264  1.171766  1.607079
c  1.339361  0.297800  0.095200
h  1.107761  0.915610 -0.808302

In [81]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

In [82]:
import pandas as pd

df=pd.DataFrame({"One":[1,2,3,4,5],"Two":[10,20,30,40,50]})
df

   One  Two
0    1   10
1    2   20
2    3   30
3    4   40
4    5   50

In [83]:
df.replace({5:70,4:48})

   One  Two
0    1   10
1    2   20
2    3   30
3   48   40
4   70   50

In [84]:
dic={"Name":pd.Series(["Div","Mut","Naru","Vani","Diva","Krish","Achu"]) ,
                     "Age":pd.Series([25,25,6,89,91,25,29]),
    "Rating":pd.Series([4.23,5.16,7.89,8.9,6,7,8.9])}
df1=pd.DataFrame(dic)
df1

    Name  Age  Rating
0    Div   25    4.23
1    Mut   25    5.16
2   Naru    6    7.89
3   Vani   89    8.90
4   Diva   91    6.00
5  Krish   25    7.00
6   Achu   29    8.90

In [85]:
df1["score"]=pd.Series([70,70,80,90,95,85,87])

In [86]:
df1

    Name  Age  Rating  score
0    Div   25    4.23     70
1    Mut   25    5.16     70
2   Naru    6    7.89     80
3   Vani   89    8.90     90
4   Diva   91    6.00     95
5  Krish   25    7.00     85
6   Achu   29    8.90     87

In [87]:
df1.groupby(['Age'])['score'].sum()  #persons with age 25 scored 225

Age
6      80
25    225
29     87
89     90
91     95
Name: score, dtype: int64

In [88]:
df1.groupby(['Age'])['Rating','score'].agg([np.mean,np.median,np.std])  #Mean/Median/Std Age with rating and score std will be there for more than one value exits below has age 25 with 3 records

       Rating                  score
         mean median       std  mean median       std
Age
6    7.890000   7.89       NaN    80     80       NaN
25   5.463333   5.16  1.409693    75     70  8.660254
29   8.900000   8.90       NaN    87     87       NaN
89   8.900000   8.90       NaN    90     90       NaN
91   6.000000   6.00       NaN    95     95       NaN

In [89]:
df2=pd.DataFrame({'id':[1,2,3,4,5],'Name':['Div','Diva','Dinesh','Deepa','Dikshit'],'sub_id':['s1','s2','s6','s4','s5']})
df1=pd.DataFrame({'id':[1,2,3,4,5],'Name':["Naresh","Nandhu","Naren","Nair","Naveen"],'sub_id':['s3','s2','s6','s4','s5']})

In [90]:
df1

   id    Name sub_id
0   1  Naresh     s3
1   2  Nandhu     s2
2   3   Naren     s6
3   4    Nair     s4
4   5  Naveen     s5

In [91]:
df2

   id     Name sub_id
0   1      Div     s1
1   2     Diva     s2
2   3   Dinesh     s6
3   4    Deepa     s4
4   5  Dikshit     s5

In [92]:
pd.merge(df2,df1,on='id')

   id   Name_x sub_id_x  Name_y sub_id_y
0   1      Div       s1  Naresh       s3
1   2     Diva       s2  Nandhu       s2
2   3   Dinesh       s6   Naren       s6
3   4    Deepa       s4    Nair       s4
4   5  Dikshit       s5  Naveen       s5

In [93]:
pd.merge(df2,df1,on=['id','sub_id']) # how ==>default inner (only matched things will get displayed here s2,s6,s4,s5)

   id   Name_x sub_id  Name_y
0   2     Diva     s2  Nandhu
1   3   Dinesh     s6   Naren
2   4    Deepa     s4    Nair
3   5  Dikshit     s5  Naveen

In [94]:
pd.merge(df2,df1,on=['id','sub_id'],how="right")  #df1 matched values will come only s3 is not matched here

   id   Name_x sub_id  Name_y
0   2     Diva     s2  Nandhu
1   3   Dinesh     s6   Naren
2   4    Deepa     s4    Nair
3   5  Dikshit     s5  Naveen
4   1      NaN     s3  Naresh

In [95]:
pd.merge(df2,df1,on=['id','sub_id'],how="left")  #df2 matched values will come only s1 is not macthed here

   id   Name_x sub_id  Name_y
0   1      Div     s1     NaN
1   2     Diva     s2  Nandhu
2   3   Dinesh     s6   Naren
3   4    Deepa     s4    Nair
4   5  Dikshit     s5  Naveen

In [96]:
pd.concat([df1,df2],axis=1,keys=["left","right"])  #first dataframe given will be in left second in right

  left                right
    id    Name sub_id    id     Name sub_id
0    1  Naresh     s3     1      Div     s1
1    2  Nandhu     s2     2     Diva     s2
2    3   Naren     s6     3   Dinesh     s6
3    4    Nair     s4     4    Deepa     s4
4    5  Naveen     s5     5  Dikshit     s5

In [97]:
pd.concat([df1,df2],ignore_index=True)

   id     Name sub_id
0   1   Naresh     s3
1   2   Nandhu     s2
2   3    Naren     s6
3   4     Nair     s4
4   5   Naveen     s5
5   1      Div     s1
6   2     Diva     s2
7   3   Dinesh     s6
8   4    Deepa     s4
9   5  Dikshit     s5

In [98]:
df1.append(df2,ignore_index=True)  #index will be ignored and added up

   id     Name sub_id
0   1   Naresh     s3
1   2   Nandhu     s2
2   3    Naren     s6
3   4     Nair     s4
4   5   Naveen     s5
5   1      Div     s1
6   2     Diva     s2
7   3   Dinesh     s6
8   4    Deepa     s4
9   5  Dikshit     s5

In [99]:
df_x=pd.merge(df2,df1,on='id')
df_x

   id   Name_x sub_id_x  Name_y sub_id_y
0   1      Div       s1  Naresh       s3
1   2     Diva       s2  Nandhu       s2
2   3   Dinesh       s6   Naren       s6
3   4    Deepa       s4    Nair       s4
4   5  Dikshit       s5  Naveen       s5

In [100]:
df_x.to_csv('test.csv')   #commonly used is CSV(Memory saving) and Excel . saved in CWD if want to search import os ,pwd= os.getcwd() , pwd
#pickle and feather will also be used for memory saving

In [101]:
df_test=pd.read_csv('test.csv')
df_test

   Unnamed: 0  id   Name_x sub_id_x  Name_y sub_id_y
0           0   1      Div       s1  Naresh       s3
1           1   2     Diva       s2  Nandhu       s2
2           2   3   Dinesh       s6   Naren       s6
3           3   4    Deepa       s4    Nair       s4
4           4   5  Dikshit       s5  Naveen       s5

In [102]:
df1_test=pd.read_csv('test.csv',index_col=0)   #will take col name with 0 as first column
df1_test

   id   Name_x sub_id_x  Name_y sub_id_y
0   1      Div       s1  Naresh       s3
1   2     Diva       s2  Nandhu       s2
2   3   Dinesh       s6   Naren       s6
3   4    Deepa       s4    Nair       s4
4   5  Dikshit       s5  Naveen       s5

In [103]:
pd.read_csv?  #syntax along with explanation

SyntaxError: invalid syntax (<ipython-input-103-605fb9018f48>, line 1)

In [ ]:
pd.merge?

In [ ]:
pd.pivot?

In [ ]:
pd.pivot_table?

In [ ]:
#Time functions
print(pd.datetime.now())

In [ ]:
pd.to_datetime(pd.Series(['Jul 31, 2009','2010-01-10',None,'7 Oct , 2010']))

In [ ]:
pd.date_range('1/1/2019',periods=5)  #takes day as default

In [ ]:
pd.date_range('1/1/2019',periods=5 , freq="M") #takes month as step

In [ ]:
text=pd.Series(["Data science",'python','random forest','nlp','na!ve','Navbase','Linea! regression',1234,np.nan,'analytics','search'])
text

In [ ]:
text.str.lower()

In [ ]:
text.str.upper()

In [ ]:
text.str.len()

In [ ]:
text.str.strip()  #whitespace removal

In [ ]:
text.str.cat(sep='-')  #as integer is there in our input

In [ ]:
text.str.contains('a')

In [ ]:
text.str.replace('r','p')

In [ ]:
text.str.count('l')

In [ ]:
text

In [ ]:
text.str.isnumeric()

In [ ]:
text1=pd.Series(["Data science",'python','random forest','nlp','na!ve','Navbase','Linea! regression',np.nan,'analytics','search'])
text1
text1.str.cat(sep='-')

In [ ]:
text2=pd.Series(["Data science",1,5,'nlp','na!ve','Navbase','Linea! regression',np.nan,'analytics','search'])
text2

In [ ]:
text2.str.isnumeric()